print(input("ชื่อ "))

# print(input("อายุ "))
อายุ = int(input("อายุ "))

# print(input("ส่วนสูง" + "cm"))
ส่วนสูง = int(input("ส่วนสูง " + "cm"))
print(ส่วนสูง)

# print(input("พละกำลัง"+ 1-10))
พละกำลัง = int(input("พละกำลัง+ 1-10"))
print(พละกำลัง)

เงินติดตัว = float(input("เงินติดตัว"+ "บาท"))
print(เงินติดตัว)

if อายุ >= 18 and พละกำลัง >= 7 and เงินติดตัว >= 10000:
    print("เข้าแก็งค์ได้")
elif อายุ < 18:
    print("อายุไม่ถึง")
elif พละกำลัง < 7:
    print("พละกำลังไม่ถึง")
elif เงินติดตัว < 10000:
    print("เงินติดตัวไม่ถึง")
else:
    print("เข้าแก็งค์ไม่ได้")