print(input("ชื่อ "))

# print(input("อายุ "))
อายุ = int(input("อายุ "))

# print(input("ส่วนสูง" + "cm"))
ส่วนสูง = int(input("ส่วนสูง " + "cm "))
print(ส่วนสูง,"cm")

# print(input("พละกำลัง"+ 1-10))
พละกำลัง = int(input("พละกำลัง+ 1-10 "))
print(พละกำลัง)

เงินติดตัว = int(input("เงินติดตัว "+ "บาท "))
print(เงินติดตัว,"บาท")

if อายุ >= 18 and พละกำลัง >= 7 and เงินติดตัว <= 10000:
    print("เข้าแก็งค์ได้")
elif อายุ >= 18 and พละกำลัง >= 7 and เงินติดตัว <= 20000:
    print("ตำแหน่ง: เบ๋")
elif อายุ >= 18 and พละกำลัง >= 7 and เงินติดตัว <= 50000:
    print("ตำแหน่ง: คนหาเงิน")
elif อายุ >= 18 and พละกำลัง >= 7 and เงินติดตัว <= 100000:
    print("ตำแหน่ง: คนใหญ่")
elif อายุ >= 18 and พละกำลัง >= 9 and เงินติดตัว >= 200000:
    print("ตำแหน่ง: มือขวา")            
elif อายุ < 18 and พละกำลัง < 7 and เงินติดตัว < 10000:
    print("อายุไม่ถึง, พละกำลังไม่ถึง, เงินติดตัวไม่ถึง")
elif อายุ < 18:
    print("อายุไม่ถึง")
elif พละกำลัง < 7:
    print("พละกำลังไม่ถึง")
elif เงินติดตัว < 10000:
    print("เงินติดตัวไม่ถึง")
else:
    print("เข้าแก็งค์ไม่ได้")